app/views/projects/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 3]]
---
                <tbody>
                <% project.tasks.each do |task| %>