app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "1"], ["created_at", "2018-03-19 02:01:14.859630"], ["updated_at", "2018-03-19 02:01:14.859630"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "name" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["name", "1dff"], ["updated_at", "2018-03-22 21:52:48.166848"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 2]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 14]]
---
  def destroy
     @project.tasks.each do |item|
      item.destroy
    end
    @project.destroy