app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "status", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "scdcsd"], ["status", 12], ["project_id", 1], ["created_at", "2018-03-19 02:01:21.960259"], ["updated_at", "2018-03-19 02:01:21.960259"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "name" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["name", "sdcdsc!!!!!!!!!!!"], ["updated_at", "2018-03-22 21:59:55.082753"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)